{
  "architectures": ["ViTForImageClassification"],
  "model_type": "vit",
  "id2label": {
    "0": "Class 0",
    "1": "Class 1",
    "2": "Class 2",
    "3": "Class 3",
    "4": "Class 4"
  },
  "label2id": {
    "Class 0": 0,
    "Class 1": 1,
    "Class 2": 2,
    "Class 3": 3,
    "Class 4": 4
  }
}