{
  "_name_or_path": "plant_analyzer_model",
  "architectures": ["ViTForImageClassification"],
  "model_type": "vit",
  "id2label": {
    "0": "Healthy",
    "1": "Early Blight",
    "2": "Late Blight",
    "3": "Insect Defoliation",
    "4": "Powdery Mildew"
  }
}