{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "African Violet (Saintpaulia ionantha)",
    "1": "Aloe Vera",
    "2": "Anthurium (Anthurium andraeanum)",
    "3": "Areca Palm (Dypsis lutescens)",
    "4": "Asparagus Fern (Asparagus setaceus)",
    "5": "Begonia (Begonia spp.)",
    "6": "Bird of Paradise (Strelitzia reginae)",
    "7": "Birds Nest Fern (Asplenium nidus)",
    "8": "Boston Fern (Nephrolepis exaltata)",
    "9": "Calathea",
    "10": "Cast Iron Plant (Aspidistra elatior)",
    "11": "Chinese Money Plant (Pilea peperomioides)",
    "12": "Chinese evergreen (Aglaonema)",
    "13": "Christmas Cactus (Schlumbergera bridgesii)",
    "14": "Chrysanthemum",
    "15": "Ctenanthe",
    "16": "Daffodils (Narcissus spp.)",
    "17": "Dracaena",
    "18": "Dumb Cane (Dieffenbachia spp.)",
    "19": "Elephant Ear (Alocasia spp.)",
    "20": "English Ivy (Hedera helix)",
    "21": "Hyacinth (Hyacinthus orientalis)",
    "22": "Iron Cross begonia (Begonia masoniana)",
    "23": "Jade plant (Crassula ovata)",
    "24": "Kalanchoe",
    "25": "Lilium (Hemerocallis)",
    "26": "Lily of the valley (Convallaria majalis)",
    "27": "Money Tree (Pachira aquatica)",
    "28": "Monstera Deliciosa (Monstera deliciosa)",
    "29": "Orchid",
    "30": "Parlor Palm (Chamaedorea elegans)",
    "31": "Peace lily",
    "32": "Poinsettia (Euphorbia pulcherrima)",
    "33": "Polka Dot Plant (Hypoestes phyllostachya)",
    "34": "Ponytail Palm (Beaucarnea recurvata)",
    "35": "Pothos (Ivy arum)",
    "36": "Prayer Plant (Maranta leuconeura)",
    "37": "Rattlesnake Plant (Calathea lancifolia)",
    "38": "Rubber Plant (Ficus elastica)",
    "39": "Sago Palm (Cycas revoluta)",
    "40": "Schefflera",
    "41": "Snake plant (Sanseviera)",
    "42": "Tradescantia",
    "43": "Tulip",
    "44": "Venus Flytrap",
    "45": "Yucca",
    "46": "ZZ Plant (Zamioculcas zamiifolia)"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "African Violet (Saintpaulia ionantha)": 0,
    "Aloe Vera": 1,
    "Anthurium (Anthurium andraeanum)": 2,
    "Areca Palm (Dypsis lutescens)": 3,
    "Asparagus Fern (Asparagus setaceus)": 4,
    "Begonia (Begonia spp.)": 5,
    "Bird of Paradise (Strelitzia reginae)": 6,
    "Birds Nest Fern (Asplenium nidus)": 7,
    "Boston Fern (Nephrolepis exaltata)": 8,
    "Calathea": 9,
    "Cast Iron Plant (Aspidistra elatior)": 10,
    "Chinese Money Plant (Pilea peperomioides)": 11,
    "Chinese evergreen (Aglaonema)": 12,
    "Christmas Cactus (Schlumbergera bridgesii)": 13,
    "Chrysanthemum": 14,
    "Ctenanthe": 15,
    "Daffodils (Narcissus spp.)": 16,
    "Dracaena": 17,
    "Dumb Cane (Dieffenbachia spp.)": 18,
    "Elephant Ear (Alocasia spp.)": 19,
    "English Ivy (Hedera helix)": 20,
    "Hyacinth (Hyacinthus orientalis)": 21,
    "Iron Cross begonia (Begonia masoniana)": 22,
    "Jade plant (Crassula ovata)": 23,
    "Kalanchoe": 24,
    "Lilium (Hemerocallis)": 25,
    "Lily of the valley (Convallaria majalis)": 26,
    "Money Tree (Pachira aquatica)": 27,
    "Monstera Deliciosa (Monstera deliciosa)": 28,
    "Orchid": 29,
    "Parlor Palm (Chamaedorea elegans)": 30,
    "Peace lily": 31,
    "Poinsettia (Euphorbia pulcherrima)": 32,
    "Polka Dot Plant (Hypoestes phyllostachya)": 33,
    "Ponytail Palm (Beaucarnea recurvata)": 34,
    "Pothos (Ivy arum)": 35,
    "Prayer Plant (Maranta leuconeura)": 36,
    "Rattlesnake Plant (Calathea lancifolia)": 37,
    "Rubber Plant (Ficus elastica)": 38,
    "Sago Palm (Cycas revoluta)": 39,
    "Schefflera": 40,
    "Snake plant (Sanseviera)": 41,
    "Tradescantia": 42,
    "Tulip": 43,
    "Venus Flytrap": 44,
    "Yucca": 45,
    "ZZ Plant (Zamioculcas zamiifolia)": 46
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.6"
}
