{
  "architectures": ["ViTForImageClassification"],
  "model_type": "vit",
  "id2label": {
    "0": "ID_0",
    "1": "ID_1",
    "2": "ID_2",
    "3": "ID_3",
    "4": "ID_4"
  },
  "label2id": {
    "ID_0": 0,
    "ID_1": 1,
    "ID_2": 2,
    "ID_3": 3,
    "ID_4": 4
  }
}