{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 192,
  "id2label": {
    "0": "Corn___Common_Rust",
    "1": "Corn___Gray_Leaf_Spot",
    "2": "Corn___Healthy",
    "3": "Invalid",
    "4": "Potato___Early_Blight",
    "5": "Potato___Healthy",
    "6": "Potato___Late_Blight",
    "7": "Rice___Brown_Spot",
    "8": "Rice___Healthy",
    "9": "Rice___Leaf_Blast",
    "10": "Wheat___Brown_Rust",
    "11": "Wheat___Healthy",
    "12": "Wheat___Yellow_Rust",
    "13": "Rice_Bacterial Blight Disease",
    "14": "Rice_Blast Disease",
    "15": "Rice_Brown Spot Disease",
    "16": "Rice_False Smut Disease",
    "17": "sugarcane_Bacterial Blight",
    "18": "sugarcane_Healthy",
    "19": "sugarcane_Red Rot"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "label2id": {
    "Corn___Common_Rust": 0,
    "Corn___Gray_Leaf_Spot": 1,
    "Corn___Healthy": 2,
    "Invalid": 3,
    "Potato___Early_Blight": 4,
    "Potato___Healthy": 5,
    "Potato___Late_Blight": 6,
    "Rice_Bacterial Blight Disease": 13,
    "Rice_Blast Disease": 14,
    "Rice_Brown Spot Disease": 15,
    "Rice_False Smut Disease": 16,
    "Rice___Brown_Spot": 7,
    "Rice___Healthy": 8,
    "Rice___Leaf_Blast": 9,
    "Wheat___Brown_Rust": 10,
    "Wheat___Healthy": 11,
    "Wheat___Yellow_Rust": 12,
    "sugarcane_Bacterial Blight": 17,
    "sugarcane_Healthy": 18,
    "sugarcane_Red Rot": 19
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 3,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 192,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.6"
}
